<details ><summary>apply for portal 2025-03-06 04:14:50 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.portal[0] will be updated in-place
  ~ resource "cloudns_dns_record" "portal" {
        id    = "564862953"
      ~ value = "104.243.35.45" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.portal_wildcard[0] will be updated in-place
  ~ resource "cloudns_dns_record" "portal_wildcard" {
        id    = "564836688"
        name  = "*"
      ~ value = "104.243.35.45" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.portal[0].module.portal_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
module.portal[0].module.portal_deployment.akash_deployment.service: Creating...
module.portal[0].module.portal_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.portal[0].module.portal_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.portal[0].module.portal_deployment.akash_deployment.service: Creation complete after 26s [id=20514950:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

mysql_endpoint = "provider.ny-01.node.infra.lumeweb.com:30613"
renterd_bus_endpoint = "bus.pinner-portal-renterd-cluster.node.pinner.xyz"

```
</details>
</details>